lib/tasks/dev.rake

SELECT  "coins".* FROM "coins" WHERE "coins"."description" = ? AND "coins"."acronym" = ? AND "coins"."url_img" = ? LIMIT ?  [["description", "Bitcoin"], ["acronym", "BTC"], ["url_img", "https://pngimg.com/uploads/bitcoin/bitcoin_PNG47.png"], ["LIMIT", 1]]
SELECT  "mining_types".* FROM "mining_types" WHERE "mining_types"."acronym" = ? LIMIT ?  [["acronym", "PoW"], ["LIMIT", 1]]
SELECT "mining_types".* FROM "mining_types"
INSERT INTO "coins" ("description", "acronym", "url_img", "created_at", "updated_at", "mining_type_id") VALUES (?, ?, ?, ?, ?, ?)
---
  task add_coins: :environment do
    show_spinner("Cadastrando Moedas...") do
      coins = [
          {
              description: "Bitcoin",
              acronym: "BTC",
              url_img: "https://pngimg.com/uploads/bitcoin/bitcoin_PNG47.png",
              mining_type: MiningType.find_by(acronym: 'PoW')
          },
          {
              description: "Ethereum",
              acronym: "ETC",
              url_img: "https://cdn.iconscout.com/icon/free/png-256/ethereum-7-645810.png",
              mining_type: MiningType.all.sample
          },
          {
              description: "Dash",
              acronym: "DASH",
              url_img: "https://s2.coinmarketcap.com/static/img/coins/200x200/131.png",
              mining_type: MiningType.all.sample
          }
      ]

      coins.each do |coin|
        Coin.find_or_create_by!(coin)

INSERT INTO "mining_types" ("description", "acronym", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Proof of Work"], ["acronym", "PoW"], ["created_at", "2020-04-25 22:58:16.043492"], ["updated_at", "2020-04-25 22:58:16.043492"]]
---
  task add_types: :environment do
    show_spinner("Cadastrando Tipos de Minerção...") do
      types = [
          {
              description: "Proof of Work",
              acronym: "PoW"
          },
          {
              description: "Proof of Stake",
              acronym: "PoS"
          },
          {
              description: "Proof of Capacity",
              acronym: "PoC"
          }
      ]

      types.each do |types|
        MiningType.find_or_create_by!(types)