app/controllers/coins_controller.rb

SELECT "coins".* FROM "coins"
---
  def index
    @coins = Coin.all

INSERT INTO "coins" ("description", "acronym", "url_img", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["description", "BitCoin"], ["acronym", "CTC"], ["url_img", ""], ["created_at", "2020-04-20 21:14:02.540452"], ["updated_at", "2020-04-20 21:14:02.540452"]]
---
  def create
    @coin = Coin.new(coin_params)

    respond_to do |format|
      if @coin.save

UPDATE "coins" SET "description" = ?, "updated_at" = ? WHERE "coins"."id" = ?  [["description", "BITCOIN"], ["updated_at", "2020-04-20 22:50:42.687659"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @coin.update(coin_params)

DELETE FROM "coins" WHERE "coins"."id" = ?  [["id", 1]]
---
  def destroy
    @coin.destroy

SELECT  "coins".* FROM "coins" WHERE "coins"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_coin
    @coin = Coin.find(params[:id])

SELECT "mining_types".* FROM "mining_types"
---
  def set_mining_type_options
    @mining_type_options = MiningType.all.collect { |m| [m.description, m.id] }